trade_exp/src/Reports/ПрайсЛист/ПрайсЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="26a3401d-077d-42ee-92ba-02ec9cc2edb3">
  <name>ПрайсЛист</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

trade_exp/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/Ассортимент/Ассортимент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0a31d50e-b19b-40a9-8ffd-9699c8120070">
  <name>Ассортимент</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="940ef8dd-ad07-4f6a-8dbf-91d7b36a078b">
    <name>КоллекцияНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="97f5df5b-1411-4bf9-a504-ce020e1e532a">
    <name>РазрешеныПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0d8e8fa9-4001-46aa-940d-14d1d2320de8">
    <name>РольАссортимента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2c1c49d4-0fdf-4dc2-a6fb-44640db9ff76">
    <name>РазрешеныЗакупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="250d3404-27bd-41c1-b988-c762d0d8d77b">
    <name>РейтингПродаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3f1cef6a-2f05-4e71-bf77-7ed57d2b26de">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="b87d309e-0f04-4549-ba1f-582854ffc4e0">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c08b1b99-a567-4abe-8172-87a6e0f879fe">
    <name>ОбъектПланирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/ТоварныеОграничения/ТоварныеОграничения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварныеОграничения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>НормаПотребления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>УпаковкаЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ОбеспечениеЗаказовПриПоддержанииЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СреднедневноеПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СреднееОтклонениеПотребления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МетодОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СтраховоеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МинимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>АлгоритмРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="79e85354-95b1-4fa4-912d-e98823eec07c">
    <name>ПределМИН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="33ce8317-c35e-4bb4-9e22-34e5046989ad">
    <name>ПределМАКС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ЕстьРекомендацияПоИзменению</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭтоГруппировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРасчетаРекомендаций</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЭтоДействующийПараметр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="78280a32-83cd-4d53-9f8a-a6d612ce998a">
    <name>ГруппировкаТоварныхОграничений</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ef115090-8fca-4521-9bd1-ecc07f568bec">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3a3a65ce-80a9-435f-9aa2-21d5add59229">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa1025d7-0232-4124-8a64-816e44306389">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыДействияВидовЦен/СтатусыДействияВидовЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДействияВидовЦен</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e2decfa9-b21b-4b8e-9bae-aa344ce05ffe">
    <name>НеДействует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Reports/ПрайсЛист/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Перед("ПриКомпоновкеРезультата")
Процедура Док_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
СхемаКомпоновкиДанных.НаборыДанных.ПрайсЛист.Запрос=ТекстЗапроса();	
КонецПроцедуры

Функция ТекстЗапроса()

	возврат 
"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
|	Сегменты.Номенклатура КАК Номенклатура,
|	Сегменты.Характеристика КАК Характеристика,
|	ИСТИНА КАК ИспользуетсяОтборПоСегментуНоменклатуры
|ПОМЕСТИТЬ ОтборПоСегментуНоменклатуры
|ИЗ
|	РегистрСведений.НоменклатураСегмента КАК Сегменты
|{ГДЕ
|	Сегменты.Сегмент.* КАК СегментНоменклатуры,
|	Сегменты.Номенклатура.* КАК Номенклатура,
|	Сегменты.Характеристика.* КАК Характеристика}
|
|ИНДЕКСИРОВАТЬ ПО
|	Номенклатура,
|	Характеристика,
|	ИспользуетсяОтборПоСегментуНоменклатуры
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	Ассортимент.Номенклатура КАК Номенклатура,
|	Ассортимент.ОбъектПланирования КАК ОбъектПланирования,
|	ИСТИНА КАК ИспользуетсяОтборПоАссортименту
|ПОМЕСТИТЬ ОтборПоАссортименту
|ИЗ
|	РегистрСведений.Ассортимент.СрезПоследних(&Период, ) КАК Ассортимент
|{ГДЕ
|	Ассортимент.Номенклатура.* КАК Номенклатура,
|	Ассортимент.ОбъектПланирования.* КАК ОбъектПланирования,
|	Ассортимент.КоллекцияНоменклатуры.* КАК КоллекцияНоменклатуры,
|	Ассортимент.РазрешеныПродажи КАК РазрешеныПродажи}
|
|ИНДЕКСИРОВАТЬ ПО
|	Номенклатура,
|	ОбъектПланирования,
|	ИспользуетсяОтборПоАссортименту
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ОстатокНаСкладе.Номенклатура КАК Номенклатура,
|	ОстатокНаСкладе.Характеристика КАК Характеристика,
|	ОстатокНаСкладе.Склад КАК Склад,
|	ОстатокНаСкладе.ВНаличииОстаток - ОстатокНаСкладе.РезервироватьНаСкладеОстаток - ОстатокНаСкладе.РезервироватьПоМереПоступленияОстаток КАК Остаток
|ПОМЕСТИТЬ СвободныеОстаткиИзРегистров	
|ИЗ
|	РегистрНакопления.ЗапасыИПотребности.Остатки(, Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ОстатокНаСкладе
|ГДЕ
|	ОстатокНаСкладе.ВНаличииОстаток - ОстатокНаСкладе.РезервироватьНаСкладеОстаток - ОстатокНаСкладе.РезервироватьПоМереПоступленияОстаток > 0
|
|ИНДЕКСИРОВАТЬ ПО
|	Номенклатура,
|	Характеристика,
|	Склад
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ОстатокНаСкладе.Номенклатура КАК Номенклатура,
|	ОстатокНаСкладе.Характеристика КАК Характеристика,
|	ОстатокНаСкладе.Склад КАК Склад,
|	ОстатокНаСкладе.Остаток КАК Остаток,
|	ТоварныеОграничения.СтраховоеКоличествоЗапаса КАК СтраховоеКоличествоЗапаса,
|	ТоварныеОграничения.МинимальноеКоличествоЗапаса КАК МинимальноеКоличествоЗапаса,
|	ТоварныеОграничения.МаксимальноеКоличествоЗапаса КАК МаксимальноеКоличествоЗапаса,
|	ТоварныеОграничения.МетодОбеспеченияПотребностей КАК МетодОбеспеченияПотребностей
|ПОМЕСТИТЬ СвободныеОстатки
|ИЗ
|	СвободныеОстаткиИзРегистров КАК ОстатокНаСкладе
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
|		ПО &ПодстановкаТоварногоОграничения
|ГДЕ
|	ОстатокНаСкладе.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	Наборы.Владелец КАК Набор,
|	КомплектующиеНабора.Ссылка КАК Комплектующие,
|	СУММА(КомплектующиеНабора.ДоляСтоимости) КАК СуммаДолейСтоимости
|ПОМЕСТИТЬ ДолиНаборов
|ИЗ
|	Справочник.ВариантыКомплектацииНоменклатуры КАК Наборы
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК КомплектующиеНабора
|		ПО Наборы.Ссылка = КомплектующиеНабора.Ссылка
|ГДЕ
|	НЕ Наборы.ПометкаУдаления
|	И НЕ Наборы.Владелец.ПометкаУдаления
|	И Наборы.ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям)
|
|СГРУППИРОВАТЬ ПО
|	Наборы.Владелец,
|	КомплектующиеНабора.Ссылка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	Наборы.Владелец КАК Набор,
|	КомплектующиеНабора.Ссылка КАК Комплектующие,
|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
|	СУММА(ЦеныНоменклатурыСрезПоследних.Цена) КАК СуммаЦенКомплектующих,
|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЦеныНоменклатурыСрезПоследних.Валюта) КАК КоличествоВалют
|ПОМЕСТИТЬ НаборыРаспределениеПоЦенам
|ИЗ
|	Справочник.ВариантыКомплектацииНоменклатуры КАК Наборы
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК КомплектующиеНабора
|		ПО Наборы.Ссылка = КомплектующиеНабора.Ссылка
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, {ВидЦены В (&ВидыЦен)}) КАК ЦеныНоменклатурыСрезПоследних
|		ПО (КомплектующиеНабора.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
|			И (КомплектующиеНабора.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика)
|ГДЕ
|	НЕ Наборы.ПометкаУдаления
|	И НЕ Наборы.Владелец.ПометкаУдаления
|	И Наборы.ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам)
|
|СГРУППИРОВАТЬ ПО
|	Наборы.Владелец,
|	КомплектующиеНабора.Ссылка,
|	ЦеныНоменклатурыСрезПоследних.ВидЦены
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	КомплектующиеНомеклатурыЦенаПоКомплектующим.Ссылка.Владелец КАК НаборНоменклатуры,
|	ЕСТЬNULL(КомплектующиеНомеклатурыЦенаПоКомплектующим.Количество, 0) КАК КоличествоВНаборе,
|	ЕСТЬNULL(КомплектующиеНомеклатурыЦенаПоКомплектующим.Количество, 0) * ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаНабора,
|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
|	"""" КАК ЦенаСтрокой,
|	ВЫБОР
|		КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
|			ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.ЕдиницаИзмерения
|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка
|	КОНЕЦ КАК Упаковка,
|	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
|	ВЫБОР
|		КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
|			ТОГДА СвободныеОстатки.Остаток
|		ИНАЧЕ СвободныеОстатки.Остаток / &ТекстЗапросаКоэффициентУпаковки
|	КОНЕЦ КАК Остаток,
|	ВЫБОР
|		КОГДА СвободныеОстатки.Остаток <= 0
|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.НетВНаличии)
|		ИНАЧЕ ВЫБОР
|				КОГДА СвободныеОстатки.Остаток <= СвободныеОстатки.МинимальноеКоличествоЗапаса
|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.УточняйтеНаличие)
|				ИНАЧЕ ВЫБОР
|						КОГДА СвободныеОстатки.Остаток < СвободныеОстатки.СтраховоеКоличествоЗапаса + СвободныеОстатки.МинимальноеКоличествоЗапаса
|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Мало)
|						ИНАЧЕ ВЫБОР
|								КОГДА СвободныеОстатки.Остаток < СвободныеОстатки.МаксимальноеКоличествоЗапаса
|									ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Достаточно)
|								ИНАЧЕ ВЫБОР
|										КОГДА СвободныеОстатки.Остаток >= СвободныеОстатки.МаксимальноеКоличествоЗапаса
|											ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Много)
|										ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Неизвестно)
|									КОНЕЦ
|							КОНЕЦ
|					КОНЕЦ
|			КОНЕЦ
|	КОНЕЦ КАК ОстатокТекстом,
|	СвободныеОстатки.Склад КАК Склад,
|	СвободныеОстатки.МетодОбеспеченияПотребностей КАК МетодОбеспеченияПотребностей
|ПОМЕСТИТЬ Цены
|ИЗ
|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, {ВидЦены В (&ВидыЦен)} {((Номенклатура, Характеристика) В
|			    (ВЫБРАТЬ
|			        ОтборПоСегментуНоменклатуры.Номенклатура,
|			        ОтборПоСегментуНоменклатуры.Характеристика
|			    ИЗ
|			        ОтборПоСегментуНоменклатуры
|			    ГДЕ
|			        ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Номенклатура В
|			    (ВЫБРАТЬ
|			        ОтборПоАссортименту.Номенклатура
|			    ИЗ
|			        ОтборПоАссортименту
|			    ГДЕ
|			        ОтборПоАссортименту.ИспользуетсяОтборПоАссортименту = &ИспользуетсяОтборПоАссортименту)) КАК Поле4}) КАК ЦеныНоменклатурыСрезПоследних
|		ЛЕВОЕ СОЕДИНЕНИЕ СвободныеОстатки КАК СвободныеОстатки
|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = СвободныеОстатки.Номенклатура
|			И ЦеныНоменклатурыСрезПоследних.Характеристика = СвободныеОстатки.Характеристика
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК КомплектующиеНомеклатурыЦенаПоКомплектующим
|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = КомплектующиеНомеклатурыЦенаПоКомплектующим.Номенклатура
|			И ЦеныНоменклатурыСрезПоследних.Характеристика = КомплектующиеНомеклатурыЦенаПоКомплектующим.Характеристика
|			И (ЦеныНоменклатурыСрезПоследних.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
|					И ЦеныНоменклатурыСрезПоследних.Номенклатура.ЕдиницаИзмерения = КомплектующиеНомеклатурыЦенаПоКомплектующим.Упаковка
|				ИЛИ ЦеныНоменклатурыСрезПоследних.Упаковка = КомплектующиеНомеклатурыЦенаПоКомплектующим.Упаковка)
|			И (КомплектующиеНомеклатурыЦенаПоКомплектующим.Ссылка.ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих))
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК НаборНомеклатурыЦенаПоНабору
|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = НаборНомеклатурыЦенаПоНабору.Владелец
|			И (НаборНомеклатурыЦенаПоНабору.ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам)
|				ИЛИ НаборНомеклатурыЦенаПоНабору.ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям))
|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, {(ВидЦены) КАК ВидЦеныДиапазон}) КАК ЦеныНоменклатурыОтбор
|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ЦеныНоменклатурыОтбор.Номенклатура
|			И ЦеныНоменклатурыСрезПоследних.Характеристика = ЦеныНоменклатурыОтбор.Характеристика}
|ГДЕ
|	ЦеныНоменклатурыСрезПоследних.Цена > 0
|	И НаборНомеклатурыЦенаПоНабору.Ссылка ЕСТЬ NULL
|{ГДЕ
|	ЦеныНоменклатурыОтбор.Цена КАК ЦенаОт,
|	ЦеныНоменклатурыОтбор.Цена КАК ЦенаДо}
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ДолиНаборов.Набор,
|	КомплектующиеНабораЦеныПоНабору.Количество,
|	ВЫБОР
|		КОГДА НЕ ДолиНаборов.Набор ЕСТЬ NULL
|				И ДолиНаборов.СуммаДолейСтоимости > 0
|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * КомплектующиеНабораЦеныПоНабору.ДоляСтоимости / ДолиНаборов.СуммаДолейСтоимости
|		ИНАЧЕ 0
|	КОНЕЦ,
|	КомплектующиеНабораЦеныПоНабору.Номенклатура,
|	КомплектующиеНабораЦеныПоНабору.Характеристика,
|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
|	ВЫБОР
|		КОГДА НЕ ДолиНаборов.Набор ЕСТЬ NULL
|				И ДолиНаборов.СуммаДолейСтоимости > 0
|				И НЕ КомплектующиеНабораЦеныПоНабору.Номенклатура ЕСТЬ NULL
|				И КомплектующиеНабораЦеныПоНабору.Количество > 0
|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * КомплектующиеНабораЦеныПоНабору.ДоляСтоимости / ДолиНаборов.СуммаДолейСтоимости / КомплектующиеНабораЦеныПоНабору.Количество
|		ИНАЧЕ 0
|	КОНЕЦ,
|	"""",
|	ВЫБОР
|		КОГДА КомплектующиеНабораЦеныПоНабору.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
|			ТОГДА КомплектующиеНабораЦеныПоНабору.Номенклатура.ЕдиницаИзмерения
|		ИНАЧЕ КомплектующиеНабораЦеныПоНабору.Упаковка
|	КОНЕЦ,
|	ЦеныНоменклатурыСрезПоследних.Валюта,
|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЦеноваяГруппа,
|	ВЫБОР
|		КОГДА КомплектующиеНабораЦеныПоНабору.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
|			ТОГДА СвободныеОстатки.Остаток
|		ИНАЧЕ СвободныеОстатки.Остаток / &ТекстЗапросаВторойКоэффициентУпаковки
|	КОНЕЦ,
|	ВЫБОР
|		КОГДА СвободныеОстатки.Остаток <= 0
|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.НетВНаличии)
|		ИНАЧЕ ВЫБОР
|				КОГДА СвободныеОстатки.Остаток <= СвободныеОстатки.МинимальноеКоличествоЗапаса
|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.УточняйтеНаличие)
|				ИНАЧЕ ВЫБОР
|						КОГДА СвободныеОстатки.Остаток < СвободныеОстатки.СтраховоеКоличествоЗапаса + СвободныеОстатки.МинимальноеКоличествоЗапаса
|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Мало)
|						ИНАЧЕ ВЫБОР
|								КОГДА СвободныеОстатки.Остаток < СвободныеОстатки.МаксимальноеКоличествоЗапаса
|									ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Достаточно)
|								ИНАЧЕ ВЫБОР
|										КОГДА СвободныеОстатки.Остаток >= СвободныеОстатки.МаксимальноеКоличествоЗапаса
|											ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Много)
|										ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Неизвестно)
|									КОНЕЦ
|							КОНЕЦ
|					КОНЕЦ
|			КОНЕЦ
|	КОНЕЦ,
|	СвободныеОстатки.Склад,
|	СвободныеОстатки.МетодОбеспеченияПотребностей
|ИЗ
|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, {ВидЦены В (&ВидыЦен)} {((Номенклатура, Характеристика) В
|			    (ВЫБРАТЬ
|			        ОтборПоСегментуНоменклатуры.Номенклатура,
|			        ОтборПоСегментуНоменклатуры.Характеристика
|			    ИЗ
|			        ОтборПоСегментуНоменклатуры
|			    ГДЕ
|			        ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Номенклатура В
|			    (ВЫБРАТЬ
|			        ОтборПоАссортименту.Номенклатура
|			    ИЗ
|			        ОтборПоАссортименту
|			    ГДЕ
|			        ОтборПоАссортименту.ИспользуетсяОтборПоАссортименту = &ИспользуетсяОтборПоАссортименту)) КАК Поле4, (Номенклатура В
|			    (ВЫБРАТЬ
|			        ДолиНаборов.Набор
|			    ИЗ
|			        ДолиНаборов)) КАК Поле2}) КАК ЦеныНоменклатурыСрезПоследних
|		ЛЕВОЕ СОЕДИНЕНИЕ ДолиНаборов КАК ДолиНаборов
|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ДолиНаборов.Набор
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК КомплектующиеНабораЦеныПоНабору
|		ПО (ДолиНаборов.Комплектующие = КомплектующиеНабораЦеныПоНабору.Ссылка)
|		ЛЕВОЕ СОЕДИНЕНИЕ СвободныеОстатки КАК СвободныеОстатки
|		ПО (КомплектующиеНабораЦеныПоНабору.Номенклатура = СвободныеОстатки.Номенклатура)
|			И (КомплектующиеНабораЦеныПоНабору.Характеристика = СвободныеОстатки.Характеристика)
|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, {(ВидЦены) КАК ВидЦеныДиапазон}) КАК ЦеныНоменклатурыОтбор
|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ЦеныНоменклатурыОтбор.Номенклатура
|			И ЦеныНоменклатурыСрезПоследних.Характеристика = ЦеныНоменклатурыОтбор.Характеристика}
|ГДЕ
|	ЦеныНоменклатурыСрезПоследних.Цена > 0
|	И ДолиНаборов.Набор ЕСТЬ НЕ NULL 
|{ГДЕ
|	ЦеныНоменклатурыОтбор.Цена КАК ЦенаОт,
|	ЦеныНоменклатурыОтбор.Цена КАК ЦенаДо}
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	НаборыРаспределениеПоЦенам.Набор,
|	КомплектующиеНабораЦеныПоНабору.Количество,
|	ВЫБОР
|		КОГДА НЕ НаборыРаспределениеПоЦенам.Набор ЕСТЬ NULL
|				И НаборыРаспределениеПоЦенам.СуммаЦенКомплектующих > 0
|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * ЦеныНоменклатурыКомплектующихСрезПоследних.Цена / НаборыРаспределениеПоЦенам.СуммаЦенКомплектующих
|		ИНАЧЕ 0
|	КОНЕЦ,
|	КомплектующиеНабораЦеныПоНабору.Номенклатура,
|	КомплектующиеНабораЦеныПоНабору.Характеристика,
|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
|	ВЫБОР
|		КОГДА НаборыРаспределениеПоЦенам.КоличествоВалют = 1
|				И НЕ НаборыРаспределениеПоЦенам.Набор ЕСТЬ NULL
|				И НаборыРаспределениеПоЦенам.СуммаЦенКомплектующих > 0
|				И НЕ КомплектующиеНабораЦеныПоНабору.Номенклатура ЕСТЬ NULL
|				И КомплектующиеНабораЦеныПоНабору.Количество > 0
|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * ЦеныНоменклатурыКомплектующихСрезПоследних.Цена / НаборыРаспределениеПоЦенам.СуммаЦенКомплектующих / КомплектующиеНабораЦеныПоНабору.Количество
|		ИНАЧЕ 0
|	КОНЕЦ,
|	ВЫБОР
|		КОГДА НаборыРаспределениеПоЦенам.КоличествоВалют > 1
|			ТОГДА ""-""
|		ИНАЧЕ """"
|	КОНЕЦ,
|	ВЫБОР
|		КОГДА КомплектующиеНабораЦеныПоНабору.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
|			ТОГДА КомплектующиеНабораЦеныПоНабору.Номенклатура.ЕдиницаИзмерения
|		ИНАЧЕ КомплектующиеНабораЦеныПоНабору.Упаковка
|	КОНЕЦ,
|	ЦеныНоменклатурыСрезПоследних.Валюта,
|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЦеноваяГруппа,
|	ВЫБОР
|		КОГДА КомплектующиеНабораЦеныПоНабору.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
|			ТОГДА СвободныеОстатки.Остаток
|		ИНАЧЕ СвободныеОстатки.Остаток / &ТекстЗапросаВторойКоэффициентУпаковки
|	КОНЕЦ,
|	ВЫБОР
|		КОГДА СвободныеОстатки.Остаток <= 0
|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.НетВНаличии)
|		ИНАЧЕ ВЫБОР
|				КОГДА СвободныеОстатки.Остаток <= СвободныеОстатки.МинимальноеКоличествоЗапаса
|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.УточняйтеНаличие)
|				ИНАЧЕ ВЫБОР
|						КОГДА СвободныеОстатки.Остаток < СвободныеОстатки.СтраховоеКоличествоЗапаса + СвободныеОстатки.МинимальноеКоличествоЗапаса
|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Мало)
|						ИНАЧЕ ВЫБОР
|								КОГДА СвободныеОстатки.Остаток < СвободныеОстатки.МаксимальноеКоличествоЗапаса
|									ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Достаточно)
|								ИНАЧЕ ВЫБОР
|										КОГДА СвободныеОстатки.Остаток >= СвободныеОстатки.МаксимальноеКоличествоЗапаса
|											ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Много)
|										ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.Неизвестно)
|									КОНЕЦ
|							КОНЕЦ
|					КОНЕЦ
|			КОНЕЦ
|	КОНЕЦ,
|	СвободныеОстатки.Склад,
|	СвободныеОстатки.МетодОбеспеченияПотребностей
|ИЗ
|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, {ВидЦены В (&ВидыЦен)} {((Номенклатура, Характеристика) В
|			    (ВЫБРАТЬ
|			        ОтборПоСегментуНоменклатуры.Номенклатура,
|			        ОтборПоСегментуНоменклатуры.Характеристика
|			    ИЗ
|			        ОтборПоСегментуНоменклатуры
|			    ГДЕ
|			        ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)) КАК Поле2, (Номенклатура В
|			    (ВЫБРАТЬ
|			        ОтборПоАссортименту.Номенклатура
|			    ИЗ
|			        ОтборПоАссортименту
|			    ГДЕ
|			        ОтборПоАссортименту.ИспользуетсяОтборПоАссортименту = &ИспользуетсяОтборПоАссортименту)) КАК Поле4, (Номенклатура В
|			    (ВЫБРАТЬ
|			        НаборыРаспределениеПоЦенам.Набор
|			    ИЗ
|			        НаборыРаспределениеПоЦенам)) КАК Поле2}) КАК ЦеныНоменклатурыСрезПоследних
|		ЛЕВОЕ СОЕДИНЕНИЕ НаборыРаспределениеПоЦенам КАК НаборыРаспределениеПоЦенам
|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = НаборыРаспределениеПоЦенам.Набор
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК КомплектующиеНабораЦеныПоНабору
|		ПО (НаборыРаспределениеПоЦенам.Комплектующие = КомплектующиеНабораЦеныПоНабору.Ссылка)
|			И (ЦеныНоменклатурыСрезПоследних.ВидЦены = НаборыРаспределениеПоЦенам.ВидЦены)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, {ВидЦены В (&ВидыЦен)}) КАК ЦеныНоменклатурыКомплектующихСрезПоследних
|		ПО (КомплектующиеНабораЦеныПоНабору.Номенклатура = ЦеныНоменклатурыКомплектующихСрезПоследних.Номенклатура)
|			И (КомплектующиеНабораЦеныПоНабору.Характеристика = ЦеныНоменклатурыКомплектующихСрезПоследних.Характеристика)
|			И ЦеныНоменклатурыСрезПоследних.ВидЦены = ЦеныНоменклатурыКомплектующихСрезПоследних.ВидЦены
|		ЛЕВОЕ СОЕДИНЕНИЕ СвободныеОстатки КАК СвободныеОстатки
|		ПО (КомплектующиеНабораЦеныПоНабору.Номенклатура = СвободныеОстатки.Номенклатура)
|			И (КомплектующиеНабораЦеныПоНабору.Характеристика = СвободныеОстатки.Характеристика)
|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, {(ВидЦены) КАК ВидЦеныДиапазон}) КАК ЦеныНоменклатурыОтбор
|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ЦеныНоменклатурыОтбор.Номенклатура
|			И ЦеныНоменклатурыСрезПоследних.Характеристика = ЦеныНоменклатурыОтбор.Характеристика}
|ГДЕ
|	ЦеныНоменклатурыКомплектующихСрезПоследних.Цена > 0
|	И НаборыРаспределениеПоЦенам.Набор ЕСТЬ НЕ NULL 
|{ГДЕ
|	ЦеныНоменклатурыОтбор.Цена КАК ЦенаОт,
|	ЦеныНоменклатурыОтбор.Цена КАК ЦенаДо}
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	Цены.НаборНоменклатуры КАК НаборНоменклатуры,
|	Цены.КоличествоВНаборе КАК КоличествоВНаборе,
|	Цены.ЦенаНабора КАК ЦенаНабора,
|	ВЫБОР
|		КОГДА Цены.НаборНоменклатуры ЕСТЬ NULL
|			ТОГДА 0
|		ИНАЧЕ 1
|	КОНЕЦ КАК СчетчикКомплектующих,
|	Цены.Номенклатура КАК Номенклатура,
|	Цены.Характеристика КАК Характеристика,
|	Цены.ВидЦены КАК ВидЦены,
|	ВЫБОР
|		КОГДА Цены.НаборНоменклатуры ЕСТЬ NULL
|				И Цены.ЦенаСтрокой = ""-""
|			ТОГДА Цены.ЦенаСтрокой
|		ИНАЧЕ Цены.Цена
|	КОНЕЦ КАК Цена,
|	Цены.Упаковка КАК Упаковка,
|	Цены.Валюта КАК Валюта,
|	Цены.ЦеноваяГруппа КАК ЦеноваяГруппа,
|	Цены.Склад КАК Склад,
|	ВЫБОР
|		КОГДА Цены.Остаток < 0
|			ТОГДА 0
|		ИНАЧЕ Цены.Остаток
|	КОНЕЦ КАК Остаток,
|	ВЫБОР
|		КОГДА Цены.МетодОбеспеченияПотребностей = ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ)
|				ИЛИ Цены.МетодОбеспеченияПотребностей ЕСТЬ NULL
|					И Цены.Остаток > 0
|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДоступностьТовараДляКлиента.ПодЗаказ)
|		ИНАЧЕ Цены.ОстатокТекстом
|	КОНЕЦ КАК ОстатокТекстом,
|	ВЫБОР
|		КОГДА Цены.ВидЦены.ГруппаВидовЦен.Ссылка ЕСТЬ NULL
|			ТОГДА Цены.ВидЦены.Наименование
|		ИНАЧЕ Цены.ВидЦены.ГруппаВидовЦен.Наименование
|	КОНЕЦ КАК ВидЦеныНаименование
|{ВЫБРАТЬ
|	Номенклатура.*,
|	Характеристика.*,
|	ВидЦены.*,
|	Цена,
|	Упаковка.*,
|	Валюта.*,
|	ЦеноваяГруппа.*,
|	Склад.*}
|ИЗ
|	Цены КАК Цены
|ГДЕ
|	Цены.ВидЦены.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)
|{ГДЕ
|	Цены.Номенклатура.*,
|	Цены.Характеристика.*,
|	Цены.ВидЦены.*,
|	Цены.Цена,
|	Цены.Упаковка.*,
|	Цены.Валюта.*,
|	Цены.Склад.*}";	

КонецФункции // ТекстЗапроса()

&ИзменениеИКонтроль("ПриКомпоновкеРезультата")
Процедура Док_ПриКомпоновкеРезультата1(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.ПрайсЛист.Запрос;
	ТекстЗапроса = СтрЗаменить(
	ТекстЗапроса, 
	"&ТекстЗапросаКоэффициентУпаковки", 
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЦеныНоменклатурыСрезПоследних.Упаковка", 
	"ЦеныНоменклатурыСрезПоследних.Номенклатура"));

	ТекстЗапроса = СтрЗаменить(
	ТекстЗапроса, 
	"&ТекстЗапросаВторойКоэффициентУпаковки", 
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"КомплектующиеНабораЦеныПоНабору.Упаковка", 
	"КомплектующиеНабораЦеныПоНабору.Номенклатура"));

	Поля = "ОстатокНаСкладе.Номенклатура,ОстатокНаСкладе.Характеристика,ОстатокНаСкладе.Склад";
	ТекстЗапроса = РегистрыСведений.ТоварныеОграничения.ПодставитьСоединение(ТекстЗапроса, "ПодстановкаТоварногоОграничения", Поля);
	
	НаборыВыводятся = ВОтчетеВыводятсяНаборыНоменклатуры(КомпоновщикНастроек);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НаборыВыводятся", ?(НаборыВыводятся, "Истина", "Ложь"));
	
	СхемаКомпоновкиДанных.НаборыДанных.ПрайсЛист.Запрос = ТекстЗапроса;

	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);

	АссортиментСервер.ВключитьОтборПоАссортиментуВСКД(КомпоновщикНастроек);

	ПараметрыДанныхКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных;
	ПараметрРазмерИзображений = ПараметрыДанныхКомпоновщика.Элементы.Найти("РазмерИзображений");
	Если ПараметрРазмерИзображений <> Неопределено Тогда
		СтруктураРазмера =  УстановитьРазмерИзображений(ПараметрРазмерИзображений.Значение);
		ВыводитьИзображение = ПараметрРазмерИзображений.Использование;
	Иначе
		ВыводитьИзображение = Ложь;
	КонецЕсли;

	НастроитьВыводКартинок(ВыводитьИзображение);

	Если ВыводитьИзображение Тогда

		СтандартнаяОбработка = Ложь;

		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);	

		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки, Истина);

		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);

		//Корректировка документа результата
		КолКолонок = ДокументРезультат.ШиринаТаблицы;
		КолСтрок =   ДокументРезультат.ВысотаТаблицы;

		Для Кол = 1 По КолКолонок Цикл

			Для Стр = 1 По КолСтрок Цикл

				ТекЯчейка = ДокументРезультат.Область(Стр, Кол);
				Если ТекЯчейка.Расшифровка <> Неопределено Тогда

					ПоляРасшифровки = ДанныеРасшифровки.Элементы[ТекЯчейка.Расшифровка].ПолучитьПоля();

					Если ПоляРасшифровки.Количество() > 0 Тогда

						ТекПолеРасшифровки = ПоляРасшифровки[0].Значение;

						Если ТипЗнч(ТекПолеРасшифровки) = Тип("СправочникСсылка.НоменклатураПрисоединенныеФайлы") 
							и ЗначениеЗаполнено(ТекПолеРасшифровки)  Тогда
                            #Удаление
							Рисунок = РаботаСФайлами.ДвоичныеДанныеФайла(ТекПолеРасшифровки); 
							#КонецУдаления
							#Вставка        
							Попытка     
								Рисунок = РаботаСФайлами.ДвоичныеДанныеФайла(ТекПолеРасшифровки);
							Исключение    
								Рисунок = Неопределено;
							КонецПопытки;	
							#КонецВставки
							Если Рисунок <> Неопределено Тогда

								ТекЯчейка.ВысотаСтроки 	= СтруктураРазмера.ВысотаСтроки;
								ТекЯчейка.ШиринаКолонки = СтруктураРазмера.ШиринаКолонки;

								Рис = ДокументРезультат.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
								Рис.РазмерКартинки = РазмерКартинки.Пропорционально;
								Рис.Картинка = Новый картинка(Рисунок);
								Рис.Расположить(ТекЯчейка);

							КонецЕсли;

						КонецЕсли;

					КонецЕсли;

				КонецЕсли;

			КонецЦикла;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

#КонецЕсли
